[
  "First trimester (weeks 1-12) is critical for fetal development. Key nutrients needed include folic acid (400-800 mcg daily), iron, calcium, and DHA. Common symptoms include nausea, fatigue, breast tenderness, and frequent urination. Avoid alcohol, smoking, and certain medications. Regular prenatal care is essential.",
  "Morning sickness in first trimester affects 70-80% of pregnant women. Management includes eating small, frequent meals, avoiding triggers, staying hydrated, and considering vitamin B6 or ginger supplements. Severe nausea and vomiting (hyperemesis gravidarum) requires medical attention.",
  "Folic acid supplementation (400-800 mcg daily) is crucial in first trimester to prevent neural tube defects. Start taking folic acid at least one month before conception and continue through first trimester. Natural sources include leafy greens, citrus fruits, and fortified cereals.",
  "Second trimester (weeks 13-26) is often the most comfortable period. Energy levels typically improve, and morning sickness usually subsides. Fetal movement begins around 18-20 weeks. Weight gain should be gradual (1-2 pounds per week). Focus on balanced nutrition and regular exercise.",
  "Kick counting should begin around 28 weeks (late second trimester). Count fetal movements for one hour after meals. Normal is 10 movements in 2 hours. Decreased fetal movement requires immediate medical attention. Use kick counting apps or charts to track patterns.",
  "Third trimester (weeks 27-40) brings increased discomfort including back pain, heartburn, and difficulty sleeping. Fetal growth accelerates, and weight gain should be monitored. Regular prenatal visits become more frequent. Prepare for labor and delivery.",
  "Braxton Hicks contractions are normal in third trimester. They are irregular, mild, and don't increase in intensity. True labor contractions are regular, increase in intensity, and don't stop with rest. Contact healthcare provider if contractions are regular and increasing.",
  "Medication safety in pregnancy follows FDA categories: Category A (safest), B (likely safe), C (unknown), D (risky), X (contraindicated). Always consult healthcare provider before taking any medication. Some safe options include acetaminophen for pain, certain antihistamines, and most prenatal vitamins.",
  "Avoid NSAIDs (ibuprofen, aspirin) in third trimester as they can cause premature closure of fetal ductus arteriosus. Acetaminophen is generally safe for pain relief. Always discuss medication changes with healthcare provider, especially in first trimester.",
  "Pregnancy nutrition requires 300-500 extra calories daily. Key nutrients: protein (71g daily), iron (27mg), calcium (1000mg), DHA (200-300mg), and folic acid. Eat variety of fruits, vegetables, whole grains, lean proteins, and dairy. Limit caffeine to 200mg daily.",
  "Food safety is crucial during pregnancy. Avoid raw fish, undercooked meat, unpasteurized dairy, deli meats, and high-mercury fish. Wash all fruits and vegetables thoroughly. Cook meat to proper temperatures. Avoid alcohol completely.",
  "Seek immediate medical attention for: severe abdominal pain, heavy bleeding, severe headaches with vision changes, persistent vomiting, high fever, decreased fetal movement, or signs of preterm labor. These symptoms may indicate serious complications requiring urgent care.",
  "Preterm labor warning signs include regular contractions before 37 weeks, pelvic pressure, low back pain, abdominal cramping, or changes in vaginal discharge. Contact healthcare provider immediately if experiencing these symptoms.",
  "Pregnancy can affect mental health. Common concerns include anxiety, mood changes, and depression. Perinatal depression affects 10-15% of women. Seek support from healthcare providers, family, and mental health professionals. Treatment options include therapy and safe medications.",
  "Regular exercise during pregnancy is beneficial for most women. Recommended: 150 minutes of moderate-intensity exercise weekly. Safe activities include walking, swimming, prenatal yoga, and low-impact aerobics. Avoid contact sports, high-altitude activities, and exercises with fall risk.",
  "Sleep changes are common during pregnancy. First trimester: increased fatigue and need for sleep. Third trimester: difficulty sleeping due to discomfort, frequent urination, and anxiety. Sleep on left side to improve circulation. Use pregnancy pillows for comfort."
]